{"longitude":"-93.2967","latitude":"44.994507","id":"0603ab07755393ca","company":"DC-Group","country":"US","source":"Monster","jobkey":"0603ab07755393ca","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"Lead Electronic Test Engineer Position Description The Lead Test Engineer demonstrates proficiency in communicating business goals, programs and processes for... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=0603ab07755393ca&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\">Position Description\n<br>The Lead Test Engineer demonstrates proficiency in communicating business goals, programs and processes for the Test Engineer Team. The Lead Test Engineer will apply technical, communications and leadership skills to support time critical needs for component testing of current and legacy commercial UPS systems and associated systems, including electronic and mechanical component refurbishment and acceptance testing, failure analysis and component replacement.\n<br>Responsibilities\n<br>Develop system verification and validation (V&amp;V) test requirements to insure products meet system specification\n<br>Perform and evaluate V&amp;V tests of electronic and electro-mechanical components.\n<br>Testing to support component failure analysis including report generation\n<br>Support documentation, analysis and resolution of conditions adverse to quality for multiple vendor commercial UPS systems\n<br>Testing to support equivalent replacement for discontinued components\n<br>Generate and verify test documentation\n<br>Establish and maintain productive working relationships with test engineering team members\n<br>Interface with inventory, technical, and operations team members to ensure smooth workflow and quick resolution to issues affecting production\n<br><br>\nRequirements\n<br>Bachelor&acirc;&#128;&#153;s Degree in Electrical Engineering or related Electrical Engineering Experience\n<br>Minimum 3 years of experience developing and performing testing of complex control systems\n<br>Minimum 1 year experience with digital and analog electronic circuit testing\n<br>Minimum 1 year of experience in all steps of the test life cycle\n<br>Minimum of 1 year of experience with digital and analog electronic circuit testing of components including printed circuit board layout techniques\n<br>Minimum of 1 year of experience with lab tools and test equipment\n    </span>","zipcode":55411,"created":1364486783000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=0603ab07755393ca&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Lead Electronic Test Engineer","date":"Thu, 28 Mar 2013 16:06:23 GMT","formattedRelativeTime":"27 days ago"}