{"longitude":"-93.2967","latitude":"44.994507","id":"173720d050be92ec","company":"GAF Elk","country":"US","source":"GAF Elk","jobkey":"173720d050be92ec","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"Job Description: GAF, founded in 1886, is a $3 billion company with 3,200 employees and is a leader in the building materials industry. As America's largest... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=173720d050be92ec&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\"><b>Job Description:</b><br>\nGAF, founded in 1886, is a $3 billion company with 3,200\n<br>employees and is a leader in the building materials\n<br>industry. As America's largest roofing manufacturer, GAF\n<br>has built a strong and solid product and customer\n<br>franchise driven by continuous product innovation and\n<br>through finding ways to better serve and connect with\n<br>its customers. The residential roofing line is sold\n<br>under the GAF brand and commercial roofing is sold under\n<br>the GAF brand. The company also has other offerings in\n<br>high quality products including decking, railings,\n<br>ductwork, and specialty fabrics. GAF has sustained a\n<br>strong financial and operating performance over the past\n<br>several years, driven from its leading capabilities,\n<br>strong culture, and a business that is only partly\n<br>dependent on economic cycles in the construction\n<br>industry.\n<br>Labeled the best in quality and most-recommended by our\n<br>customers, GAF believes that employees remain our\n<br>greatest strength and best competitive advantage. Build\n<br>your future as we build the American dream one roof at a\n<br>time.\n<br>The Transportation Planner II&acirc;&#128;&#153;s responsibilities include\n<br>working with and supporting Corporate\n<br>Transportation/Logistics and the Plant Logistics Manager\n<br>in developing a distribution strategy to support their\n<br>plant site. This includes identification of potential\n<br>distribution points within remote markets. They will be\n<br>responsible for building and maintaining the carrier\n<br>base, including Private Fleet where applicable, to\n<br>support all of these shipping sites, across all\n<br>transportation modes. This carrier base will need to\n<br>meet the cost, service, and volume requirements of the\n<br>plant and the customers it serves. This includes ongoing\n<br>communications, performance reviews, and negotiations\n<br>with the established carriers, as well as prospecting\n<br>for new carriers and new transportation modes that add\n<br>value and strengthen the established base. He/she is\n<br>also responsible for managing all load tendering\n<br>function activities for their assigned plant and\n<br>affiliated warehouses, in a manner that ensures cost\n<br>effective transportation of finished goods and inbound\n<br>raw materials at service levels that meet corporate and\n<br>plant objectives.\n<br>The Transportation Planner II will use computer\n<br>applications to determine shipping requirements, measure\n<br>carrier performance, manage shipment reliability,\n<br>perform cost/service analyses, and coordinate activities\n<br>related to shipment scheduling through delivery.\n<br>Specific responsibilities include, but are not limited\n<br><br><b>to:</b><br><ul>\n<li>Ensure that all orders are dispatched and assigned for</li>\n</ul>\npickup on the appropriate ship date to meet promised\n<br>delivery dates, within approved traffic lane pricing\n<br>guidelines.\n<br><ul>\n<li>Negotiate rates and truck service with motor carriers</li>\n</ul>\ndoing business with GAFMC, for assigned Plants within\n<br>approved traffic lane pricing guidelines.\n<br><ul>\n<li>Work with the Dock Scheduling Coordinator and Carriers</li>\n</ul>\nto ensure that all shipments are scheduled and picked up\n<br>on a daily basis within dock schedule guidelines to meet\n<br>daily manpower deployment objectives for the Plant.\n<br><ul>\n<li>For those Plants that deploy private fleet equipment,</li>\n</ul>\nensure that fleet trucks assigned to the Plant are\n<br>dispatched and deployed in a cost effective manner,\n<br>under established private fleet deployment and pricing\n<br>guidelines.\n<br><ul>\n<li>With assistance from Corporate Transportation and the</li>\n</ul>\nLogistics Manager, develop and maintain a carrier base\n<br>to support the planned service sales territories and\n<br>shipment volume. Actively participate in efforts to\n<br>expand the carrier base to meet demand spikes caused by\n<br>sales promotions, seasonal buys, weather related\n<br>business spikes, etc. This includes ongoing\n<br>communications, and negotiation, with the established\n<br>carriers as well as prospecting for new carriers that\n<br>add value and strengthen the established base.\n<br><ul>\n<li>Manage Shipment Demand through daily review of order</li>\n</ul>\nintake against Plant and carrier capacities using\n<br>established \"Ship Cap\" processes.\n<br><ul>\n<li>Partner with the Logistics Coordinator to ensure that</li>\n</ul>\nCustomer Service, IUT planners and Sales are provided\n<br>with accurate and timely information regarding late\n<br>shipments, late deliveries, missed pickups, rescheduled\n<br>orders, expedited orders etc. In addition, provide\n<br>appropriate levels of preparation and follow up to\n<br>ensure Job Site (Time Sensitive) deliveries are\n<br>delivered as promised.\n<br><ul>\n<li>Partner with the Logistics Coordinator to ensure that</li>\n</ul>\ncarrier equipment is loaded to maximum capacity under\n<br>established \"vary item\" process, including working with\n<br>carriers to ensure that the equipment provided meets\n<br>established order weights.\n<br><ul>\n<li>Ensure that all shipping paperwork (Bill of Landing,</li>\n</ul>\nPicking Slip, etc.) is generated on a timely basis,\n<br>distributed accurately, contains accurate information\n<br>(including tarp instructions) and is appropriately\n<br>retained for audit purposes.\n<br><ul>\n<li>Identify and implement process improvements that</li>\n</ul>\nreduce cost and improve customer service.\n<br><ul>\n<li>Utilize computer applications to determine shipping</li>\n</ul>\nrequirements, measure carrier performance, manage\n<br>shipment reliability, perform cost/service analysis, and\n<br>coordinate activities related to shipment scheduling\n<br>through delivery.\n<br><ul>\n<li>Perform other duties as assigned.</li>\n</ul>\n<b>Job Requirements:</b><br>\nA Bachelors Degree with at Three to Five years of\n<br>Transportation/Logistics experience. In addition, be\n<br>family with standard Manufacturing concepts, practices\n<br>and procedures, as well ad being acquainted with\n<br>Warehouse Management Systems (WMS-RF)\n<br>We offer a competitive salary and benefits package\n<br>including 401(k), medical, dental, vision, prescription\n<br>drug, tuition reimbursement, and a vacation package. At\n<br>GAF, we believe our employees are our greatest resource.\n<br>GAF is proud to be an Equal Opportunity Employer,\n<br>committed to workplace diversity. M/F/D/V.\n<br>No search firms please.\n    </span>","zipcode":55411,"created":1363082028000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=173720d050be92ec&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Transportation Planner II","date":"Tue, 12 Mar 2013 09:53:48 GMT","formattedRelativeTime":"30+ days ago"}