{"longitude":"-93.2967","latitude":"44.994507","id":"2260002170678708","company":"DC Group, Inc.","country":"US","source":"Monster","jobkey":"2260002170678708","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"Billing Specialist (Entry Level) DC Group a successful and growing Company is looking for an entry level Billing Specialist. This position requires high... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=2260002170678708&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\">(Entry Level)\n<br>DC Group a successful and growing Company is looking for an entry level Billing Specialist.\n<br>This position requires high attention to detail in a fast paced, high volume setting. The Billing Specialist reports to the Corporate Controller and is an important member of a 7 person Accounting Department. Must be a team player who is willing to expand roles and go the extra mile.\n<br>The Billing Specialist is responsible for the coordination and processing of the daily and periodic invoices to clients. This person must be able to communicate across departments to include Inventory/ Warehouse, Account Managers, Accounts Payable, Contracts, Sales, and Executive Management\n<br>Essential Duties and Responsibilities\n<br><br><b>Billing Processing:</b><br><ul>\n<li>Process job folders received from Account Managers.</li>\n<li>Verify billing matches sales quotes.</li>\n<li>Input billing into Great Plains (Microsoft Dynamics) accounting system.</li>\n<li>Match customer purchase orders to billing documents.</li>\n<li>Accurately assign costs from warehouse to job folders during billing processing.</li>\n</ul>\n<b>Collections:</b><br><ul>\n<li>Ensure timely delivery of all customer invoice to appropriate addresses or through on-line procedures.</li>\n<li>Follow up with customers by e-mail and phone to effectively achieve payment from customers within contract payment terms.</li>\n<li>Diligently research and pursue any payments that are late and effectively communicate late payment issue to Controller and CEO.</li>\n</ul>\n<b>Other Duties:</b><br><ul>\n<li>Answer phone calls in a back-up position to receptionist.</li>\n<li>Assist accounting department with other roles, including process payments received, monthly bank reconciliation, and cash flow reports.</li>\n<li>Special projects as assigned by Corporate Controller or CEO.</li>\n</ul>\n<b>Requirements:</b><br><ul>\n<li>Post high school education.</li>\n<li>4 year degree in Accounting a plus.</li>\n<li>Great Plains (Microsoft Dynamics) experience a plus.</li>\n<li>Must be a team player.</li>\n<li>Positive attitude.</li>\n<li>Great communicator.</li>\n<li>Dependable and responsible.</li>\n</ul>\nE-mail cover letters and resumes to charlie.kramer@dc-group.com\n    </span>","zipcode":55411,"created":1364911513000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=2260002170678708&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Billing Specialist","date":"Tue, 02 Apr 2013 14:05:13 GMT","formattedRelativeTime":"22 days ago"}