{"longitude":"-93.3022","latitude":"45.024727","id":"2cd8fbab84904c22","company":"BAYADA Home Health Care","country":"US","source":"Bayada","jobkey":"2cd8fbab84904c22","onmousedown":"indeed_clk(this, '2165');","formattedLocationFull":"Minneapolis, MN 55412","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"Are you looking for an exciting and rewarding career? Do you enjoy working with children? If yes, join our team of RNs and LPNs to provide extended hour nursing... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=2cd8fbab84904c22&qd=daeq8MGh1GkxxzpJz3qQ3W_2gW-3ycRNs8FNlxs0XtZIljV5KEe45bEBIwTzZpPhASt7Q8xJ8kP6OV5nQ5ctdIMF-ETwiDM7-r8tCBj781k&from=vj&pos=bottom","teaser":"<span class=\"summary\">Are you looking for an exciting and rewarding career? Do you enjoy working with children? If yes, join our team of RNs and LPNs to provide extended hour nursing for our seven year old client in Minneapolis! This high spirited, active little girl is looking for a nurse to help her with her morning routine and accompany her to school. She is trach dependent and is in need of a mature pediatric nurse experienced in adolescent behavioral issues. Shifts available include Monday, Wednesday, and Fridays from 7:30 am to 4:30 pm.\n<br><br>\nClinical responsibilities include adhering to the established client care plan and specific duties: administration of medication treatments, monitoring of clients condition, as well as understanding and following safety and infection control policies and practices.\n<br><br>\nCome work for an organization where you will be rewarded for your hard work and excellence, and be treated with respect and appreciation. Active nursing license and one year experience are required. Join one of the nation&acirc;&#128;&#153;s leading home care companies, apply today!\n<br><br>\nJoin one of the nation&acirc;&#128;&#153;s leading home care companies, apply today!\n<br><br>\nTo learn more about this opportunity, please contact Aubrey Wisen at 952-935-5581 or MNP-team@bayada.com.\n<br><br>\nFounded in 1975 by J. Mark Baiada, BAYADA Home Health Care provides nursing, rehabilitative, therapeutic, hospice, and assistive care services to children, adults, and seniors in the comfort of their homes. Headquartered in suburban Philadelphia, BAYADA employs more than 18,000 nurses, home health aides, therapists, medical social workers, and other home health care professionals who serve their communities in 25 states from more than 250 offices. For more information, visit www.bayada.com . We are an equal opportunity employer (EOE).\n    </span>","zipcode":55412,"created":1366327326000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=2cd8fbab84904c22&qd=daeq8MGh1GkxxzpJz3qQ3W_2gW-3ycRNs8FNlxs0XtZIljV5KEe45bEBIwTzZpPhASt7Q8xJ8kP6OV5nQ5ctdIMF-ETwiDM7-r8tCBj781k&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt8dg00n2h11n","state":"MN","jobtitle":"RN or LPN needed immediately for Pediatric Home Care in Minneapolis, MN","date":"Thu, 18 Apr 2013 23:22:06 GMT","formattedRelativeTime":"6 days ago"}