{"longitude":"-93.2967","latitude":"44.994507","id":"5ebe46ca57918315","company":"GAF Materials Corporation","country":"US","source":"GAF Materials Corporation","jobkey":"5ebe46ca57918315","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"GAF, founded in 1886, is a $3 billion company with 3,200 employees and is a leader in the building materials industry. As America 's largest roofing... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=5ebe46ca57918315&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\">GAF, founded in 1886, is a $3 billion company\nwith 3,200 employees and is a leader in the building materials\nindustry. As America 's largest roofing\nmanufacturer, GAF has built a strong and solid product and customer\nfranchise driven by continuous product innovation and through finding\nways to better serve and connect with its customers. The residential\nroofing line is sold under the GAF brand and commercial roofing is\nsold under the GAF brand. The company also has other offerings in\nhigh quality products including railings, ductwork, and specialty\nfabrics. GAF has sustained a strong financial and operating\nperformance over the past several years, driven from its leading\ncapabilities, strong culture, and a business that is only partly\ndependent on economic cycles in the construction industry.\n<br><br>\nLabeled the best in quality and most-recommended by our customers,\nGAF believes that employees remain our greatest strength and best\ncompetitive advantage. Build your future as we build the American\ndream one roof at a time.\n<br><br>\nWe are looking for a Shipping Supervisor for our\nshingle manufacturing plant in Minneapolis, Minnesota who\nwill be directly responsible for supervising the shipping/warehouse\noperation, and personnel. This position will be responsible for\nachieving excellence in executing and controlling assigned\nshipping/warehouse operations. Ensure the Standard Operating\nProcedures (SOP's) are being adhered to in the handling and storage\nof all materials; i.e. finished goods or raw materials and equipment.\nThe Shipping Supervisor will provide the required training and\ncertifications to the lift truck operators and will also be\nresponsible for the general housekeeping of the warehouse, assigning\ntasks as needed to maintain a safe, neat and orderly environment.\n<br><br>\nThe scope of this position includes direct\nsupervision of the shipping personnel and management of safety, daily\noperations, equipment maintenance, scheduling, daily inventory space,\nquality standards, and miscellaneous supply items for operating\nefficiently. This position will have overall responsibility for the\nshipping/warehouse supervision function.\n<br><br>\nSpecific responsibilities include, but are not\nlimited to:\n<br><ul>\n<li>Plan and\ndirect daily and weekly activities of the shipping/warehouse function\nto meet or exceed safety goals, service metrics, shipping/warehouse\nbudget compliance, transportation lane compliance and service\nreliability targets.\n</li>\n<li>Oversee\ninbound and outbound shipping activities; monitor performance of\noperators against standard operating procedures, identify areas for\nimprovement and implement resolution. Handle all customer service\ncompliance in regard to shipment, damage and error.\n</li>\n<li>Mange\nlabor; schedule shipping personnel work hours to minimize operating\ncosts while meeting the needs of the customers and carriers. Make\nlabor assignments fairly and without prejudice to effectively handle\nvolumes and meet the handling metrics within the rules of the\ncollective bargaining agreement. Ensure accurate usage of the WMS\nsystem in shipping, receiving and all product movement.\n</li>\n<li>Manage\ninventory; oversee the day to day warehouse operation and inventory\ncontrol to ensure there is sufficient daily production space, product\nis accurately counted, properly stored, properly rotated (FIFO),\ncycle counts are complete and accurate. Evaluate and resolve root\ncauses for inventory discrepancies.\n</li>\n<li>Provide\nproper training to shipping employees in the area of safety,\nstandards operating procedures, and quality standards. Create a safe\nwork environ men by developing safe work practices and enforcing\ncompliance with company/site safety policies., OSHA or other\nregulatory agencies. Ensures good housekeeping and provides excellent\nleadership in the safety area.\n</li>\n<li>Generate\nreports or other written correspondence needed to insure proper\nadministration of the department. Ensure that the following records\nare properly maintained, accurately summarized and forwarded to the\nappropriate parties in a timely manner.\n</li>\n<li>Ensure\nall pre and post-shift equipment inspections are conducted. Identify\nand schedule equipment maintenance needs when required. Monitor\nforklift usage and recommend adjustments to maximize utilization.\nInvestigate unreported damage.\n</li>\n<li>Perform\nother duties as assigned.\n</li>\n</ul>\n<br><b>Requirements\n</b><br><br>\nA Bachelors Degree with a minimum of Five years of\nexperience in a high volume distribution environment. In\naddition, computer skills must exceed basic knowledge to include\nMicrosoft Office and Inventory Software. APICS certification\npreferred.\n<br><br>\nWe offer a competitive salary and benefits package\nincluding 401(k), medical, dental, vision, prescription drug, tuition\nreimbursement, and a vacation package. At GAF, we believe our\nemployees are our greatest resource.\n<br><br>\nGAF is proud to be an Equal Opportunity Employer,\ncommitted to workplace diversity. M/F/D/V.\n<br><br>\nNo search firms please.\n    </span>","zipcode":55411,"created":1364295120000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=5ebe46ca57918315&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Supervisor Shipping","date":"Tue, 26 Mar 2013 10:52:00 GMT","formattedRelativeTime":"29 days ago"}