{"longitude":"-93.2967","latitude":"44.994507","id":"693cec4d6cfcb0b9","company":"GAF Materials Corporation","country":"US","source":"GAF Materials Corporation","jobkey":"693cec4d6cfcb0b9","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"GAF, founded in 1886, is a $3 billion company with 3,200 employees and is a leader in the building materials industry. As America's largest roofing manufacturer... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=693cec4d6cfcb0b9&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\">GAF, founded in 1886, is a $3 billion\ncompany with 3,200 employees and is a leader in the building\nmaterials industry. As America's largest roofing manufacturer,\nGAF has built a strong and solid product and customer franchise\ndriven by continuous product innovation and through finding ways to\nbetter serve and connect with its customers. The company also\nhas other offerings in high quality products including decking,\nrailings, decorative stone, duct work, and specialty fabrics.\nGAF has sustained a strong financial and operating performance over\nthe past several years, driven from its leading capabilities, strong\nculture, and a business that is only partly dependent on economic\ncycles in the construction industry.\n<br><br>\nLabeled the best in quality and\nmost-recommended by our customers, GAF believes that employees remain\nour greatest strength and best competitive advantage. Build\nyour future as we build the American dream one roof at a\ntime.\n<br><ul>\n<li>The Chemical Process/Boiler\nHouse Manager is primarily responsible for the operation of the\nprimary raw material processing segment of the manufacturing\noperation along with the plant steam boiler operation. The manager\nwould focus on process improvement and the reduction of process\nvariation. Working through the boiler house department supervisor and\nboiler and stills team, the Chemical Process/Boiler House\nManager would develop and maintain comprehensive procedures,\npolicies and systems to improve safety, training, quality and\nefficiency.\n<br>\n</li>\n<li>Develops and manages oxidation\noperations equipment integrity programs, (tanks piping, hot oil\nsystems, etc.).\n<br>\n</li>\n<li>Coordinates asphalt qualification\ntrial plans and provides plant support for the qualification process\nincluding trials.\n<br>\n</li>\n<li>Identifies and provides guidance for\nimplementing oxidation operations best practices.\n<br>\n</li>\n<li>Provides leadership for identified\noxidation operations process improvement activities.\n<br>\n</li>\n<li>Assures raw material specifications\nmeet the business needs.\n<br>\n</li>\n<li>Generates oxidation operations quality\nreports, monitors performance and provides follow-up appropriate to\nassure quality standards are met.\n<br>\n</li>\n<li>Drives measurement variation reduction\nassociated with asphalt test procedures.\n<br>\n</li>\n</ul>The Chemical Process/Boiler House\nManager is also responsible for maintaining excellence in developing,\nexecuting and controlling assigned projects to achieve site goals.\nThrough effective application of engineering expertise, the\nindividual will conduct analysis and investigations pertaining to\nconstruction of new equipment and processes, and alteration or\nmodification of existing facilities to optimize productive capability\nof the plant. Project recommendations are made taking into\nconsideration such factors as cost, structure, maintainability,\nfacility of production and availability of materials and equipment\nwith emphasis on safety and optimum performance.\n<br><br>\nSpecific duties include, but are\nnot limited to:\n<br><ul>\n<li>Management of the oxidation operation\nand boilers as outlined above.\n<br>\n</li>\n<li>Focus on the design and/or improvement\nof electrical and mechanical systems that manage, protect and improve\nour plant equipment and processes.\n<br>\n</li>\n<li>Manage electrical and mechanical and\nprocess projects from conception to completion, utilizing both\nin-house maintenance personnel and outside contractors.\n<br>\n</li>\n<li>Reports to the Plant\nManager.\n<br>\n</li>\n</ul>\n<b>Requirements\n</b><br><br>\nA Bachelor's Degree in Chemical\nEngineering or Electrical Engineering with a minimum of 5\nyears&acirc;&#128;&#153; experience and in a manufacturing environment. The\nideal candidate will be a self-motivated and adaptive person capable\nof successfully handling a variety of engineering assignments in\naddition to managing the oxidation and boiler operations.\nKnowledge and experience with asphalt processing, storage and\ntransport systems very desirable. Knowledge of and experience\nwith electrical distribution systems, instrumentation, PLC's and\nAC/DC drives helpful. Knowledge of rotating equipment, machine\ndesign, hydraulic, pneumatic systems, bearings, lubrication, etc. a\nplus.\n<br><br>\nWe offer a competitive salary\nand benefits package including 401(k), medical, dental, vision,\nprescription drug, tuition reimbursement, and a vacation package. At\nGAF, we believe our employees are our greatest resource.\n<br><br>\nGAF is proud to be an Equal\nOpportunity Employer, committed to workplace diversity.\nM/F/D/V.\n<br><br>\nNo search firms please.\n    </span>","zipcode":55411,"created":1365661602000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=693cec4d6cfcb0b9&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Chemical Process/Boiler House Manager","date":"Thu, 11 Apr 2013 06:26:42 GMT","formattedRelativeTime":"13 days ago"}