{"longitude":"-93.2967","latitude":"44.994507","id":"7de063fd3c47800f","company":"Castforce, Inc.","country":"US","source":"NARMS","jobkey":"7de063fd3c47800f","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"Castforce is offering contractors a new opportunity to grow their Independent Merchandising business. Using an advanced scoring system, we award areas of... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=7de063fd3c47800f&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\">Castforce is offering contractors a new opportunity to grow their Independent Merchandising business. Using an advanced scoring system, we award areas of coverage to Contractors who prove they can complete work orders correctly and on time. If accepted, you will be given a Contractor portal to view your dashboard, work orders, invoices, and calendar. Castforce offers contracting projects in CVS, Walgreens, Rite Aid, Walmart, HEB, Kroger, 7-Eleven, Albertsons, and many other major retailers nationwide.\n<br><br>\nIf you would like to join as one of our Contractors and receive contracting opportunities, please sign up using this link: http://contracting.castforce.com We only want professional Independent Merchandising Contractors, so if you are not committed to completing work orders, submitting invoices, and adhering to service level requirements, please do not apply. Thank you, Castforce, Inc. MN TAGS: Retail, Merchandising, In-store, NARMS, Merchandiser, Marketing, Product Assembly REC\n    </span>","zipcode":55411,"created":1366283880000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=7de063fd3c47800f&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Independent Contractor - MINNEAPOLIS MN","date":"Thu, 18 Apr 2013 11:18:00 GMT","formattedRelativeTime":"6 days ago"}