{"longitude":"-93.2967","latitude":"44.994507","id":"8b0f56868f174d7f","company":"GAF Materials Corporation","country":"US","source":"GAF Materials Corporation","jobkey":"8b0f56868f174d7f","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"GAF, founded in 1886, is a $3 billion company with 3,200 employees and is a leader in the building materials industry. As America's largest roofing manufacturer... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=8b0f56868f174d7f&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\">GAF, founded in 1886, is a $3 billion company with\n3,200 employees and is a leader in the building materials industry.\nAs America's largest roofing manufacturer, GAF has built a strong and\nsolid product and customer franchise driven by continuous product\ninnovation and through finding ways to better serve and connect with\nits customers. The residential roofing line is sold under the GAF\nbrand and commercial roofing is sold under the GAF brand. The company\nalso has other offerings in high quality products including decking,\nrailings, ductwork, and specialty fabrics. GAF has sustained a strong\nfinancial and operating performance over the past several years,\ndriven from its leading capabilities, strong culture, and a business\nthat is only partly dependent on economic cycles in the construction\nindustry.\n<br><br>\nLabeled the best in quality and\nmost-recommended by our customers, GAF believes that employees remain\nour greatest strength and best competitive advantage. Build your\nfuture as we build the American dream one roof at a\ntime.\n<br><br>\nThe Transportation Planner\nII&acirc;&#128;&#153;s responsibilities include working with and supporting Corporate\nTransportation/Logistics and the Plant Logistics Manager in\ndeveloping a distribution strategy to support their plant site. This includes identification\nof potential distribution points within remote markets. They will be responsible for building and maintaining the\ncarrier base, including Private Fleet where applicable, to support\nall of these shipping sites, across all transportation modes. This carrier base will need\nto meet the cost, service, and volume requirements of the plant and\nthe customers it serves.\nThis includes ongoing communications, performance reviews, and\nnegotiations with the established carriers, as well as prospecting\nfor new carriers and new transportation modes that add value and\nstrengthen the established base. He/she is also responsible for managing all load\ntendering function activities for their assigned plant and affiliated\nwarehouses, in a manner that ensures cost effective transportation of\nfinished goods and inbound raw materials at service levels that meet\ncorporate and plant objectives.\n<br><br><b>The\nTransportation Planner II will use computer applications to determine\nshipping requirements, measure carrier performance, manage shipment\nreliability, perform cost/service analyses, and coordinate activities\nrelated to shipment scheduling through delivery.\n<br><br>\nSpecific\nresponsibilities include, but are not limited\nto:\n<br>\n&Acirc;&middot;\nEnsure that all orders\nare dispatched and assigned for pickup on the appropriate ship date\nto meet promised delivery dates, within approved traffic lane pricing\nguidelines.\n<br>\n&Acirc;&middot;\nNegotiate rates and truck\nservice with motor carriers doing business with GAFMC, for assigned\nPlants within approved traffic lane pricing guidelines.\n<br>\n&Acirc;&middot;\nWork with the Dock\nScheduling Coordinator and Carriers to ensure that all shipments are\nscheduled and picked up on a daily basis within dock schedule\nguidelines to meet daily manpower deployment objectives for the\nPlant.\n<br>\n&Acirc;&middot;\nFor those Plants that\ndeploy private fleet equipment, ensure that fleet trucks assigned to\nthe Plant are dispatched and deployed in a cost effective manner,\nunder established private fleet deployment and pricing guidelines.\n<br>\n&Acirc;&middot;\nWith assistance from\nCorporate Transportation and the Logistics Manager, develop and\nmaintain a carrier base to support the planned service sales\nterritories and shipment volume. Actively participate in efforts to\nexpand the carrier base to meet demand spikes caused by sales\npromotions, seasonal buys, weather related business spikes, etc. This\nincludes ongoing communications, and negotiation, with the\nestablished carriers as well as prospecting for new carriers that add\nvalue and strengthen the established base.\n<br>\n&Acirc;&middot;\nManage Shipment Demand\nthrough daily review of order intake against Plant and carrier\ncapacities using established \"Ship Cap\" processes.\n<br>\n&Acirc;&middot;\nPartner with the\nLogistics Coordinator to ensure that Customer Service, IUT planners\nand Sales are provided with accurate and timely information regarding\nlate shipments, late deliveries, missed pickups, rescheduled orders,\nexpedited orders etc. In addition, provide appropriate levels of\npreparation and follow up to ensure Job Site (Time Sensitive)\ndeliveries are delivered as promised.\n<br>\n&Acirc;&middot;\nPartner with the\nLogistics Coordinator to ensure that carrier equipment is loaded to\nmaximum capacity under established \"vary item\" process,\nincluding working with carriers to ensure that the equipment provided\nmeets established order weights.\n<br>\n&Acirc;&middot;\nEnsure that all shipping\npaperwork (Bill of Landing, Picking Slip, etc.) is generated on a\ntimely basis, distributed accurately, contains accurate information\n(including tarp instructions) and is appropriately retained for audit\npurposes.\n<br>\n&Acirc;&middot;\nIdentify and implement\nprocess improvements that reduce cost and improve customer service.\n<br>\n&Acirc;&middot;\nUtilize computer\napplications to determine shipping requirements, measure carrier\nperformance, manage shipment reliability, perform cost/service\nanalysis, and coordinate activities related to shipment scheduling\nthrough delivery.\n<br>\n&Acirc;&middot;\nPerform other duties as\nassigned.\n<br><b>Requirements\n</b><br><br>\nA Bachelors Degree with at Three to Five years of\nTransportation/Logistics experience. In addition, be family with\nstandard Manufacturing concepts, practices and procedures, as well ad\nbeing acquainted with Warehouse Management Systems\n(WMS-RF)\n<br><br>\nWe offer a competitive salary and benefits package\nincluding 401(k), medical, dental, vision, prescription drug, tuition\nreimbursement, and a vacation package. At GAF, we believe our\nemployees are our greatest resource.\n<br><br>\nGAF is proud to be an Equal Opportunity Employer,\ncommitted to workplace diversity. M/F/D/V.\n<br><br>\nNo search firms please.\n    </b></span>","zipcode":55411,"created":1365928980000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=8b0f56868f174d7f&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Transportation Planner II","date":"Sun, 14 Apr 2013 08:43:00 GMT","formattedRelativeTime":"10 days ago"}