{"longitude":"-93.2967","latitude":"44.994507","id":"8e5690432355287f","company":"Adecco","country":"US","source":"Adecco","jobkey":"8e5690432355287f","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"Adecco, in partnership with GSI, is looking to find French Bilingual candidates with superior customer service skills for part-time, WORK AT HOME customer... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=8e5690432355287f&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\">Adecco, in partnership with GSI, is looking to find French Bilingual candidates with superior customer service skills for part-time, WORK AT HOME customer service/call center positions.\n<br><br>\nThis exciting opportunity allows you to assist retail consumers in a variety of aspects from the comfort of your own home! GSI is an industry leading organization with a strong sense of community. Come and be a part of an award winning team as a Call Center Specialist:\n<br><br>\nThe Call Center Specialist will:\n<br>\n&acirc;&#128;&cent; Provide resolutions to web based customers via email, phone, chat or traditional mail in a timely manner.\n<br>\n&acirc;&#128;&cent; Enhance revenue by providing sales assistance through use of basic, cross-selling, and up-selling sales techniques.\n<br>\n&acirc;&#128;&cent; Follow up on behalf of customer inquiries through product research, providing accurate information and recommendations for solution.\n<br>\n&acirc;&#128;&cent; Be able to identify and understand the strengths and weaknesses of competitors in the industry.\n<br>\n&acirc;&#128;&cent; Strive to provide one-call resolution to our customers.\n<br>\n&acirc;&#128;&cent; Work effectively within and contribute to a team-oriented environment.\n<br>\n&acirc;&#128;&cent; Continually look for new ways to satisfy the customer and improve processes, encouraging repeat business and increasing productivity.\n<br>\nQualified candidates should possess:\n<br>\n&acirc;&#128;&cent; MUST SPEAK BILINGUAL/FLUENT FRENCH\n<br>\n&acirc;&#128;&cent; Flexibility to work a non-traditional schedule&acirc;&#128;&#148;including weekends\n<br>\n&acirc;&#128;&cent; Computer Proficiency including Microsoft Office Suite, Database/Internet Research, and Strong Typing skills (minimum of 30 wpm)\n<br>\n&acirc;&#128;&cent; Ability to read and interpret documents such as procedure booklets, work instructions, and software manuals.\n<br>\n&acirc;&#128;&cent; Basic project management skills and the ability to work closely with clients and peers to continually understand and anticipate their needs.\n<br>\n&acirc;&#128;&cent; Problem solving, business analysis and quantitative skills.\n<br>\n&acirc;&#128;&cent; Above-average phone manner, organizational and interpersonal skills, along with exceptional writing skills (spelling and grammar), and conflict resolution experience.\n<br>\nWhile on assignment through Adecco, our associates are eligible to receive:\n<br>\n&acirc;&#128;&cent; Major Medical/Dental/Vision Insurance\n<br>\n&acirc;&#128;&cent; 6 Paid Holidays\n<br>\n&acirc;&#128;&cent; Service Bonus\n<br>\n&acirc;&#128;&cent; 401K\n<br>\n&acirc;&#128;&cent; Tuition Reimbursement\n<br>\nDon&acirc;&#128;&#153;t delay&acirc;&#128;&brvbar; Apply today!\n<br>\nThe Adecco Group is a Fortune Global 500 company and global leader in HR services. Our group connects over 700,000 associates with our business clients each day through our 6,600 offices in over 70 countries and territories around the world. Adecco offers benefits including Holiday Pay, 401(k), Insurance Benefit Plans. Adecco is an Equal Opportunity Employer.\n<br>\nIf you are a fit for this position apply at www.adeccousa.com and choose Office Number 5255 to be considered for these specific positions.\n    </span>","zipcode":55411,"created":1366714702000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=8e5690432355287f&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"French Bilingual Call Center Specialist","date":"Tue, 23 Apr 2013 10:58:22 GMT","formattedRelativeTime":"1 day ago"}