{"longitude":"-93.2967","latitude":"44.994507","id":"db647242933de7d3","company":"DC Group Inc","country":"US","source":"Monster","jobkey":"db647242933de7d3","onmousedown":"indeed_clk(this, '1114');","formattedLocationFull":"Minneapolis, MN 55411","sponsored":"false","formattedLocation":"Minneapolis, MN","snippet":"Government Sales – Uninterruptable Power Supply: Grow with one of the fastest growing companies in the country. No critical power experience required... ","city":"Minneapolis","type":"indeed","apply_url":"http://www.indeed.com/rc/clk?jk=db647242933de7d3&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&from=vj&pos=bottom","teaser":"<span class=\"summary\"><b>Government Sales &acirc;&#128;&#147; Uninterruptable Power Supply:</b><br>\nGrow with one of the fastest growing companies in the country.\n<br><b>No critical power experience required. Criterion:</b> Just great sales hunters!\n<br><br>\nDC Group is a nationwide leader in one of the fastest growing industries, critical back-up power. We provide back-up power for many Fortune 500 Companies, hospitals and government entities that require back-up power for their computer rooms. DC Group has been awarded the INC 5000 Award for 5 years as one of the fastest growing private companies in the country. We are currently hiring sales people from all fields to generate new business opportunities through solid communication and networking. If you have a track record of great communication and writing skills, then this position is for you. Industry knowledge is not necessary as we provide training and coaching so that our sales executives will be successful.\n<br><br><b>Job Requirements:</b><br>\nExcellent customer service and sales skills required Training will be provided. However, an ability to continually learn and retain knowledge is required. Must demonstrate intermediate to advanced PC skills. Requires strong interpersonal skills including excellent time management and people skills. Ability to work in fast paced, highly demanding work environment. Self motivated, pro-active, results oriented professional with an ability to work with minimum direction. Attention to detail and the persistence to navigate government procurement channels DC Group provides an excellent salary plus commission structure that awards productivity and excellence. In addition, we provide full benefits which include healthcare, dental, vacation and 401k.\n<br><br>\nJoin the team of successful professionals and a growing and exciting company. View our website at www.dc-group.com\n    </span>","zipcode":55411,"created":1364911513000,"expired":"false","url":"http://www.indeed.com/viewjob?jk=db647242933de7d3&qd=daeq8MGh1GkxxzpJz3qQ3Wekn_UpfUkvVOMSxP7rDoGHSH62WpxOub1wRUU6RPL_yCytx8VJPiFARfpLRzUYvuoCFLMibOCEabUahnuewCk&indpubnum=2780780942619443&chnl=northmpls&atk=17ovt82o30mph450","state":"MN","jobtitle":"Government Sales - Uninterruptable Power Supply","date":"Tue, 02 Apr 2013 14:05:13 GMT","formattedRelativeTime":"22 days ago"}