{"address2":"Suite 202","IP":"69.199.164.25","DateUpdated":"2013-04-19 14:11:34","teaser":"<h3>Background</h3>\n\n<p>The West Broadway Business &amp; Area Coalition (WBC) leads initiatives to bring businesses, non-profit organizations and neighbors together to create an inviting and vital West Broadway corridor that will transform the Northside into a thriving economic community. The WBC&rsquo;s key programs and initiatives are the West Broadway Façade Improvement Program, FLOW Northside Arts Crawl, the West Broadway Farmers Market, Beautification Activities, Business Resource Brokering, Retail Recruitment, and Business Networking Events. </p>\n\n<p>The WBC is currently working on a Greater North Minneapolis marketing campaign, beginning with the creation of the new website, www.northmpls.org, which celebrates the Northside and serves as a visitor and resident’s guide.  Implementation of the comprehensive campaign will grow the local economy in North Minneapolis and focus on forging and strengthening connections in the following areas:</p>\n\n<ul>\n<li>B2B &ndash; Business to Business (including non-profits and institutions)</li>\n<li>Local &amp; Metro-wide Exposure for Micro-Entrepreneurs</li>\n<li>Reach Average Customers (within and outside the neighborhood)</li>\n</ul>\n\n\n<p>The overall purpose of the project is to:</p>\n\n<ul>\n<li>Unify, brand, and market the unique commercial and cultural assets of the North Minneapolis business community to build the local economy. </li>\n<li>Highlight North Minneapolis' competitive advantages: neighborhood scale and feel, the predominance of locally owned businesses, and the well-known neighborhood fixtures and personalities of long-standing and recently opened businesses </li>\n<li>Share the stories of the individuals that make up the business and community landscape, highlighting their uniqueness while building connections. </li>\n</ul>\n\n\n<h3>Goals of the Consultancy</h3>\n\n<p>Campaign Development\nThe WBC is looking for a consultant or agency to assist in developing the campaign, providing strategy, timelines and media planning. Depending on budget constraints, the WBC may act as campaign implementer and media buyer. The consultant will work with WBC staff to leverage their deep knowledge of the Northside&rsquo;s community and business landscape and suggest the most appropriate marketing strategies for promoting the three areas listed above, at the same time building WBC staff capacity.<br/>\n</p>\n\n<p>The consultant will design a campaign with the following goals:\n<em> Increase local &amp; metro-wide exposure for micro-entrepreneurs \n</em> Increase business visibility to customers within neighborhood, residents and employees\n<em> Increase business visibility to customers outside neighborhood\n</em> Attract new businesses to locate on West Broadway and in North Minneapolis\n* Unify the North Minneapolis business community</p>\n\n<p>Such a campaign will necessarily have many arms and include multiple stages and timelines. The consultant will ensure a dynamic campaign that addresses different audiences both separately and collectively.</p>\n\n<p>The campaign to brand North Minneapolis should incorporate storytelling, and facilitate the exposure of a variety of Northside voices, thereby literally attaching many faces to the neighborhood name. These stories can be fed to local media outlets and appear in traditional print and out of home advertisements. </p>\n\n<p>The campaign should always loop back to northmpls.org, our new website that celebrates the Northside&rsquo;s businesses and presents the area as an inviting destination rich in history, art and amenities.</p>\n\n<h3>Deliverables</h3>\n\n<p>North Minneapolis marketing campaign branding, definition and strategy \nMedia Strategy\nPrint, tv, web and/or out of home advertisements</p>\n\n<h3>Proposal Contents</h3>\n\n<p>Proposals should include a line item budget that provides options.</p>\n\n<p>Timeline\nRequest for Proposals Issued: April 8th, 2013\nProposals Due: May 6st\nSelection and contracting: May 15th – June 1st \nContract Period: 3-6 months</p>\n\n<p>If you plan to respond to this RFP, please reply to WBC contact Shaina Brassard by April 19th. Those wishing to meet with WBC staff for more project background and context should request so at that time. Meeting times will be offered the week of April 22th.</p>\n\n<h2>Contact</h2>\n\n<p>Shaina Brassard<br/>\nMarketing and Communications  Coordinator<br/>\nWest Broadway Business and Area  Coalition<br/>\n1011 West Broadway Suite 202<br/>\nMinneapolis, MN 55411<br/>\n612.353.5178<br/>\nShaina@westbroadway.org</p>\n","type":"submitted","company":"West Broadway Business and Area Coalition","contact_phone":"6123535178","address1":"1011 W Broadway","url":"#/jobs/northmpls-1","created":1366040885000,"compensation":"TBD","UpdatedBy":"sundaysenergy","CreatedBy":"public","jobtype":"Temporary","city":"Minneapolis","name_last":"Brassard","company_url":"http://westbroadway.org","jobkey":"northmpls-1","country":"United States","zipcode":"55411","name_first":"Shaina","date":"2013-04-15T15:48:05","LastPage":"1","contact_email":"shaina@westbroadway.org","jobtitle":"North Minneapolis Marketing Campaign Consultant","state":"MN","source":"NorthMPLS.org"}