{"address2":"Suite 202","IP":"69.199.164.25","DateUpdated":"2013-04-19 16:47:50","teaser":"<p>Posted April 12, 2013.  Position closes Monday, April 29th, 5pm.</p>\n\n<p>The West Broadway Business and Area Coalition (WBC) is seeking a qualified and motivated individual to fill our Aggregation and Distribution Coordinator position.<br/>\n</p>\n\n<p>WBC is hiring a part-time coordinator to manage the aggregation table at the North Minneapolis farmers markets and then work to distribute that locally grown produce to other area businesses.<br/>\nThis is a part-time seasonal position May 2013-April 2014. The position will be about 20 hours per week. The pay is $15 per hour.  Hours are flexible except every Tuesday (9:30am-1:30pm), Thursday (2:30pm-7:30pm) and Friday (1pm-8pm) during farmers market season. <br/>\nDuties:  (this is not an all-inclusive list)\nNorth Minneapolis Farmers Markets</p>\n\n<ul>\n<li>Setting up a second year of the aggregation table at the West Broadway Farmers Market and/or mini markets </li>\n<li>Attaining necessary project licensing and insurance while following all safety guidelines and procedures</li>\n<li>Staffing the aggregation table</li>\n<li>Fostering relationships with local and/or Northside growers</li>\n<li>Distributing produce from the aggregation table or wholesalers to the corner stores on an as-needed basis </li>\n<li>Researching best prices for the best growing produce and ordering wholesale produce when necessary</li>\n<li>Promotion of the aggregation table as a resource to local vendors</li>\n<li>Connecting members of the local foods resource Hub and Northside Fresh to the aggregation table and Community Table Cooperative</li>\n</ul>\n\n\n<p>Distribution</p>\n\n<ul>\n<li>Fostering existing relationships with corner store owners and employees</li>\n<li>Train store owners and employees on produce handling and sales</li>\n<li>Selling locally-grown produce and locally produced foods in corner stores, and other small accounts like restaurants</li>\n<li>Encouraging and facilitating the donation to emergency food programs of local produce that is not sold to either small accounts or aggregators (ie. North Point Health and Wellness Inc.&rsquo;s food shelf)</li>\n</ul>\n\n\n<p>Research &amp; Documentation</p>\n\n<ul>\n<li>Work with other grant partners to ensure a comprehensive research and documentation process.</li>\n<li>Assist partners with community organizing to create a core group of constituents and stakeholders (including organizations, residents, businesses, schools, etc.) to draft policy recommendations to the City of Minneapolis</li>\n<li>Assist in convening a network of North Minneapolis growers/producers and vendors/sellers to collect process analysis information and successes/challenges of the relationships.</li>\n<li>Collect pertinent project data and document project processes.</li>\n<li>And other duties as assigned</li>\n</ul>\n\n\n<p>Requirements:</p>\n\n<ul>\n<li>Friendly and outgoing </li>\n<li>Customer service skills and experience</li>\n<li>Detail oriented with secure cash handling experience</li>\n<li>Hold a valid drivers license and have access to a vehicle that can haul produce year-round</li>\n<li>Ability to lift and move 50lbs</li>\n<li>Ability to multi-task</li>\n<li>An interest in healthy food access, farmers markets and locally grown food; experience as a customer or as a vendor at a farmers market.</li>\n<li>An interest/passion in farmers markets, local economic development, and place-making</li>\n<li>Flexible, organized, and able to prioritize </li>\n</ul>\n\n\n<p>Preferred:</p>\n\n<ul>\n<li>Ability to speak languages such as Hmong, Spanish, Somali, etc.</li>\n<li>Northside resident or someone who has worked with the community</li>\n<li>Interest in starting a food distribution business</li>\n<li>Experience working across cultures and with diverse communities</li>\n</ul>\n\n\n<p>To Apply: </p>\n\n<ul>\n<li>Please submit a cover letter, resume, and three professional references to alicia@westbroadway.org.</li>\n</ul>\n\n\n<p>Reports to: </p>\n\n<ul>\n<li>Programs and Outreach Manager &amp; Executive Director</li>\n</ul>\n\n\n<p>Contact:<br/>\n</p>\n\n<ul>\n<li>Alicia at 612-353-5178 or alicia@westbroadway.org for more information. </li>\n</ul>\n\n","type":"submitted","company":"West Broadway Business and Area Coalition","contact_phone":"6123535178","address1":"1011 West Broadway","url":"#/jobs/northmpls-2","created":1366389488000,"compensation":"$15/hour","UpdatedBy":"sundaysenergy","CreatedBy":"public","jobtype":"Part-Time","city":"Minneapolis","name_last":"Brassard","company_url":"http://westbroadway.org","jobkey":"northmpls-2","country":"United States","zipcode":"55411","name_first":"Shaina","date":"2013-04-19T16:38:08","LastPage":"1","contact_email":"shaina@westbroadway.org","jobtitle":"Aggregation and Distribution Coordinator","state":"MN","source":"NorthMPLS.org"}